def area(a, b):
    '''
    Возвращает площадь прямоугольника со сторонами a и b.

        Параметры:
            a (float): длина прямоугольника
            b (float): ширина прямоугольника

        Возвращаемое значение:
            float: площадь прямоугольника

        Пример:
            >>> area(3, 4)
            12
    '''
    return a * b 

def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника по длинам двух смежных сторон a и b.

        Параметры:
            a (float): длина прямоугольника
            b (float): ширина прямоугольника

        Возвращаемое значение:
            float: периметр прямоугольника

        Пример:
            >>> perimeter(3, 4)
            14
    '''
    return 2*(a + b)