def area(a):
    '''
    Возвращает площадь квадрата с заданной стороной
    
        Параметры:
            a: сторона квадрата
        
        Возвращаемое значение:
            area (float): площадь квадрата с заданной стороной
        
        Пример:
            >>> area(5)
            25
    '''
    area = a * a
    return area


def perimeter(a):
    '''
    Возвращает периметр квадрата с заданной стороной
    
        Параметры:
            a: сторона квадрата
            
        Возвращаемое значение:
            perimeter (float): периметр квадрата с заданной стороной
        
        Пример:
            >>> perimeter(6)
            24
    '''
    perimeter = 4 * a
    return perimeter
