def area(a):
    '''
    Возвращает площадь квадрата с заданной стороной
    
        Параметры:
            a (float): сторона квадрата
        
        Возвращаемое значение:
            area (float): площадь квадрата с заданной стороной
    '''
    area = a * a
    return area


def perimeter(a):
    '''
    Возвращает периметр квадрата с заданной стороной
    
        Параметры:
            a (float): сторона квадрата
            
        Возвращаемое значение:
            perimeter (float): периметр квадрата с заданной стороной
    '''
    perimeter = 4 * a
    return perimeter
