def area(a, h): 
    '''
    Возвращает площадь треугольника, вычисленную по стороне и высоте.

        Параметры:
            a (float): сторона треугольника
            h (float): высота, опущенная на a

        Возвращаемое значение:
            float: площадь треугольника

        Пример:
            >>> area(1, 2)
            1.0
    '''
    return a * h / 2 

def perimeter(a, b, c): 
    '''
    Возвращает периметр треугольника с заданными сторонами.

        Параметры:
            a (float): первая сторона треугольника
            b (float): вторая сторона треугольника
            c (float): третья сторона треугольника

        Возвращаемое значение:
            float: периметр треугольника

        Пример:
            >>> perimeter(1, 1, 1)
            3
    '''
    return a + b + c